{
  "name": "30 seconds of code",
  "dirName": "30code",
  "repoUrl": "https://github.com/30-seconds/30-seconds-of-code",
  "snippetPath": "snippets",
  "language": {
    "short": "js",
    "long": "JavaScript"
  },
  "slug": "js",
  "featured": true,
  "iconName": "js",
  "biasPenaltyMultiplier": 1,
  "splash": "laptop-plant.png",
  "description": "The JavaScript snippet collection contains a wide variety of ES6 helper functions. It includes helpers for dealing with primitives, arrays and objects, as well as algorithms, DOM manipulation functions and Node.js utilities.",
  "shortDescription": "Browse a wide variety of ES6 helper functions, including array operations, DOM manipulation, algorithms and Node.js utilities.",
  "tagMetadata": {
    "algorithm": {
      "name": "JavaScript Algorithms",
      "description": "The JavaScript algorithms collection includes implementations and examples of popular algorithms in ES6. Algorithmic snippets are primarily a learning resource, as they might already be implemented natively or require optimizations to run in production.",
      "shortDescription": "Learn a handful of popular algorithms, implemented in JavaScript ES6.",
      "splash": "widescreen.png"
    },
    "node" : {
      "name": "Node.js Snippets",
      "shortName": "Node.js",
      "description": "The Node.js snippet collection contains JavaScript utilities for Node.js 14.x. It includes helper functions related to server-side code and filesystem operations, while general-purpose helpers can be found in the JavaScript snippet collection.",
      "shortDescription": "Discover a collection of server-side JavaScript utility functions for Node.js 14.x.",
      "splash": "coffee-drip.png",
      "iconName": "node"
    },
    "browser": {
      "description": "The JavaScript snippet collection contains a wide variety of ES6 helper functions. Browser snippets include helper functions for selecting, traversing, and manipulating DOM elements, while general-purpose helpers can be found in the JavaScript snippet collection.",
      "shortDescription": "Select, traverse and manipulate DOM elements with this collection of JavaScript ES6 snippets."
    },
    "array": {
      "splash": "plant-screen.png"
    },
    "date": {
      "splash": "succulent.png"
    },
    "object": {
      "splash": "tablet.png"
    },
    "function": {
      "splash": "tablet.png"
    },
    "math": {
      "splash": "mobile.png"
    }
  }
}
